In [45]:
import numpy as np 
import pandas as pd 
import re
import math

In [46]:
salary = pd.read_csv("./data/nba_players_salary_hoop.csv")

In [42]:

salary['SALARY'] = salary['SALARY'].str.replace(',', '')
salary['SALARY'] = salary['SALARY'].str.replace('$', '')
salary['SALARY'] = salary['SALARY'].astype(int)
salary['PLAYER'] = salary['PLAYER'].str.replace('b', '') 
salary['PLAYER'] = salary['PLAYER'].str.replace("'", '')

In [43]:
salary[salary['PLAYER'] == "Stephen Curry"]

          PLAYER    SALARY
0  Stephen Curry  34682550

In [44]:
salary.head()

           PLAYER    SALARY
0   Stephen Curry  34682550
1     Leron James  33285709
2    Paul Millsap  30769231
3  Gordon Hayward  29727900
4    lake Griffin  29512900